import { EducationLevel } from "../types";

export const JUNIOR_HIGH_CORE_CODES = new Set([
  "ท21101", "ท21102", "ท22101", "ท22102", "ท23101", "ท23102",
  "ว21101", "ว21102", "ว22101", "ว22102", "ว23101", "ว23102", "222101", "222102", "223101", "223102",
  "ค21101", "ค21102", "ค22101", "ค22102", "ค23101", "ค23102",
  "พ21101", "พ21102", "พ22101", "พ22102", "พ23101", "พ23102",
  "ส21101", "ส21102", "ส21103", "ส21104", "ส22101", "ส22102", "ส22103", "ส22104", "ส23101", "ส23102", "ส23103", "ส23104",
  "ศ21101", "ศ21102", "ศ22101", "ศ22102", "ศ23101", "ศ23102",
  "ง21101", "ง21102", "ง22101", "ง22102", "ง23101", "ง23102", "121101", "121102", "1122101", "2122102", "1123101", "2ง23102",
  "อ21101", "อ21102", "อ22101", "อ22102", "อ23101", "อ23102"
]);

export const SENIOR_HIGH_CORE_CODES = new Set([
  "ท31101", "ท31102", "ท32101", "ท32102", "ท33101", "ท33102",
  "ว31101", "ว31102", "ว32101", "ว32102", "ว33101", "ว33102", "232101", "232102", "1233101", "2233102",
  "ค31101", "ค31102", "ค32101", "ค32102", "ค33101", "ค33102",
  "พ31101", "พ31102", "พ32101", "พ32102", "พ33101", "พ33102",
  "ส31101", "ส31102", "ส31103", "ส31104", "ส32101", "ส32102", "ส32103", "ส32104", "ส33101", "ส33102",
  "ศ31101", "ศ31102", "ศ32101", "ศ32102", "ศ33101", "ศ33102", "2133102",
  "ง31101", "ง31102", "ง32101", "ง32102", "ง33101", "ง33102", "1431101", "1ง32101", "2ง32102", "1ง33101", "2ง33102",
  "อ31101", "อ31102", "อ32101", "อ32102", "อ33101", "อ33102"
]);

export function getCoreOrElectiveType(code: string, level: EducationLevel): "บังคับ" | "เลือก/เพิ่มเติม" {
  const cleanCode = code.trim().replace(/\s+/g, "").toUpperCase();
  if (level === EducationLevel.JUNIOR_HIGH) {
    return JUNIOR_HIGH_CORE_CODES.has(cleanCode) ? "บังคับ" : "เลือก/เพิ่มเติม";
  } else if (level === EducationLevel.SENIOR_HIGH) {
    return SENIOR_HIGH_CORE_CODES.has(cleanCode) ? "บังคับ" : "เลือก/เพิ่มเติม";
  }
  // ประถมศึกษา (ไม่กำหนดละเอียด เท่ากับเป็นไปตามรายวิชาที่กำหนด)
  return "บังคับ";
}
